Kinsey_Dumas/DyM_custom/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          160;
        startFace       73328;
    }
    inlet
    {
        type            patch;
        nFaces          104;
        startFace       73488;
    }
    outlet
    {
        type            patch;
        nFaces          104;
        startFace       73592;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          111;
        startFace       73696;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          36510;
        startFace       73807;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          36510;
        startFace       110317;
    }
)

// ************************************************************************* //
